#include <stdio.h>

int prob[9][9] = {
	{ 0,0,0,0,0,0,0,0,0 },
	{ 0,0,0,0,0,3,0,8,5 },
	{ 0,0,1,0,2,0,0,7,0 },
	{ 0,0,0,5,0,7,0,0,0 },
	{ 0,0,4,0,0,0,1,0,0 },
	{ 0,9,0,0,0,0,0,0,0 },
	{ 5,0,0,0,0,0,0,7,3 },
	{ 0,0,2,0,1,0,0,0,0 },
	{ 0,0,0,0,4,0,0,0,9 }
};

int flag[9][9];
int x, y;

void solve(int row, int col); // 스도쿠 풀이 - 빈공간에 숫자 대입
int check(int row, int col, int num); // 빈공간에 넣을 수 있는 숫자 체크
void back_track(int row, int col); // 이전에 수를 대입했던 공간으로 돌아가 숫자를 수정
void print_sudoku(); // 스도쿠 풀이 출력

int main()
{
	for (x = 0; x < 9; x++)
	{
		for (y = 0; y < 9; y++)
		{
			solve(x, y);
			printf("x, y : (%d, %d) => %d \n", x, y, prob[x][y]);
		}
	}
	print_sudoku();
}

void solve(int row, int col)
{
	int num;

	// 문제에 주어진 숫자가 들어가 있는지 검사, flag 배열에 문제에서 주어진 숫자위치 기억 //
	if (prob[row][col] != 0) { flag[row][col] = 1;  return; }

	// 1 ~ 9 까지의 수에서 조건에 맞는 수를 찾아 숫자 입력 //
	for (num = 1; num <= 9; num++)
	{
		if (check(row, col, num) == 1)
		{
			prob[row][col] = num;
			return;
		}
	}
	// 1 ~ 9 까지의 숫자가 아무것도 들어가지 못할때 백트래킹 //
	back_track(row, col);
}

void back_track(int row, int col)
{
	int temp = 0, i;

	// 값을 넣어줬던 이전 좌표로 이동 //
	while (1)
	{
		col--;
		if (col == -1) {row--; col = 8;}
		if (flag[row][col] != 1) { x = row; y = col;  break; }
	}
	temp = prob[row][col] + 1;

	// 직전 위치의 수에 +1을 했지만 조건에 맞지 않을때 //
	if (temp > 9)
	{
		prob[row][col] = 0;
		back_track(row, col);
		return;
	}

	// 정해진 숫자가 들어갈수 있는지 체크 //
	for (i = temp; i <= 9; i++)
	{
		if (check(row, col, i) == 1)
		{
			prob[row][col] = i;
			break;
		}
		if (i == 9)
		{
			prob[row][col] = 0;
			back_track(row, col);
		}
	}
	return;
}

int check(int row, int col, int num)
{
	int i, j;
	int a = (row / 3) * 3;
	int b = (col / 3) * 3;

	// 가로축 검사 //
	for (i = 0; i < 9; i++)
	{
		if (prob[row][i] == num ) { return 0; }
	}

	// 세로축 검사 //
	for (i = 0; i < 9; i++)
	{
		if (prob[i][col] == num) { return 0; }
	}

	// 3 x 3 섹터 검사 //
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 3; j++)
		{
			if (prob[a + i][b + j] == num) { return 0; }
		}
	}
	// 검사한 숫자가 공간에 들어갈 수 있을 경우 1 반환 //
	return 1;
}

void print_sudoku()
{
	int cnt = 0, i = 0;

	printf("\n###### 풀이 결과 ######\n\n");

	while (1)
	{
		printf("%d  ", prob[i][cnt++]);

		if (cnt == 9)
		{
			printf("\n");
			i++;
			if (i == 9) { break; }
			cnt = 0;
		}
	}
}


/*
// 문제 1 : https://en.wikipedia.org/wiki/Sudoku_solving_algorithms

int sudoku[9][9] = {
{ 5,3,0,0,7,0,0,0,0 },
{ 6,0,0,1,9,5,0,0,0 },
{ 0,9,8,0,0,0,0,6,0 },
{ 8,0,0,0,6,0,0,0,3 },
{ 4,0,0,8,0,3,0,0,1 },
{ 7,0,0,0,2,0,0,0,6 },
{ 0,6,0,0,0,0,2,8,0 },
{ 0,0,0,4,1,9,0,0,5 },
{ 0,0,0,0,8,0,0,7,9 }
};
*/

/*
// 문제 2

int sudoku[9][9] = {
{ 0,3,4,6,2,0,5,7,0 },
{ 9,5,0,1,3,7,4,6,0 },
{ 6,0,7,0,0,0,3,1,2 },
{ 5,0,6,0,7,1,0,8,3 },
{ 0,7,0,4,8,6,0,5,0 },
{ 8,2,0,3,9,0,6,0,7 },
{ 4,6,8,0,0,0,7,0,5 },
{ 0,9,5,8,6,3,0,2,4 },
{ 0,1,3,0,5,4,8,9,0 }
};
*/


/*
// 문제 3 : hard http://sos440.tistory.com/305

int sudoku[9][9] = {
{ 0,0,0,3,2,0,0,1,0 },
{ 7,9,0,0,8,0,2,0,0 },
{ 0,0,0,9,0,0,0,0,6 },
{ 0,0,9,0,0,0,0,6,5 },
{ 0,8,0,0,0,0,0,3,0 },
{ 1,3,0,0,0,0,4,0,0 },
{ 2,0,0,0,0,9,0,0,0 },
{ 0,0,6,0,1,0,0,8,2 },
{ 0,7,0,0,6,5,0,0,0 }
};
*/

/*
// 문제 4 : very hard http://sos440.tistory.com/305

int sudoku[9][9] = {
{ 0,0,0,3,0,0,0,0,6 },
{ 0,0,0,0,5,1,0,0,0 },
{ 1,4,0,2,8,0,0,0,9 },
{ 0,0,4,0,0,7,6,0,0 },
{ 8,1,0,0,0,0,0,4,2 },
{ 0,0,5,4,0,0,1,0,0 },
{ 7,0,0,0,9,2,0,5,8 },
{ 0,0,0,1,7,0,0,0,0 },
{ 6,0,0,0,0,4,0,0,0 }
};
*/

/*
// 문제 5 : http://news.chosun.com/site/data/html_dir/2010/08/24/2010082400075.html?rsMobile=false

int sudoku[9][9] = {
{ 0,0,5,3,0,0,0,0,0 },
{ 8,0,0,0,0,0,0,2,0 },
{ 0,7,0,0,1,0,5,0,0 },
{ 4,0,0,0,0,5,3,0,0 },
{ 0,1,0,0,7,0,0,0,6 },
{ 0,0,3,2,0,0,0,8,0 },
{ 0,6,0,5,0,0,0,0,9 },
{ 0,0,4,0,0,0,0,3,0 },
{ 0,0,0,0,0,9,7,0,0 }
};
*/

/*
// 문제 6 :  https://en.wikipedia.org/wiki/Sudoku_solving_algorithms - 18

int sudoku[9][9] = {
{ 0,0,0,0,0,0,0,0,0 },
{ 1,2,0,0,0,0,0,8,4 },
{ 0,3,0,0,0,0,0,7,0 },
{ 0,0,4,0,0,0,6,0,0 },
{ 0,0,0,2,0,3,0,0,0 },
{ 0,0,5,0,0,0,9,0,0 },
{ 0,0,6,0,9,0,5,0,0 },
{ 0,7,0,0,0,0,0,2,0 },
{ 0,0,0,0,5,0,0,0,0 }
};
*/


/*
// 문제 7 :   http://sos440.tistory.com/305

int sudoku[9][9] = {
{ 9,0,0,0,1,0,0,6,5 },
{ 0,0,0,8,0,0,1,0,0 },
{ 0,3,0,0,0,0,4,0,9 },
{ 0,6,0,0,0,4,0,0,2 },
{ 0,0,5,1,0,7,3,0,0 },
{ 8,0,0,2,0,0,0,7,0 },
{ 4,0,9,0,0,0,0,5,0 },
{ 0,0,3,0,0,8,0,0,0 },
{ 6,5,0,0,2,0,0,0,4 }
};
*/


